In [3]:
import pandas as pd
df = pd.read_csv('dulieuxettuyendaihoc.csv',header=0,delimiter=',',encoding='utf-8')

In [5]:
df.columns

Index(['MSSV', 'GT', 'DT', 'KV', 'M1', 'M2', 'M3', 'KT', 'NGAYTHI',
       'DINHHUONGNGHENGHIEP'],
      dtype='object')

In [7]:
df.dtypes

MSSV                    object
GT                      object
DT                     float64
KV                      object
M1                     float64
M2                     float64
M3                     float64
KT                      object
NGAYTHI                 object
DINHHUONGNGHENGHIEP     object
dtype: object

In [9]:
df.index

RangeIndex(start=0, stop=100, step=1)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   MSSV                 100 non-null    object
 1   GT                   100 non-null    object
 2   DT                   3 non-null      float64
 3   KV                   100 non-null    object
 4   M1                   100 non-null    float64
 5   M2                   100 non-null    float64
 6   M3                   100 non-null    float64
 7   KT                   100 non-null    object
 8   NGAYTHI              100 non-null    object
 9   DINHHUONGNGHENGHIEP  100 non-null    object
dtypes: float64(4), object(6)
memory usage: 7.9+ KB

In [14]:
df.shape

(100, 10)

In [16]:
df['M1']

0     3.25
1     6.00
2     5.00
3     4.25
4     4.25
      ...
95    5.25
96    5.25
97    7.00
98    5.00
99    5.25
Name: M1, Length: 100, dtype: float64

In [21]:
newdf = df[['M1','M2']]
newdf

      M1    M2
0   3.25  3.25
1   6.00  4.00
2   5.00  6.75
3   4.25  4.25
4   4.25  4.50
..   ...   ...
95  5.25  1.50
96  5.25  3.75
97  7.00  8.00
98  5.00  3.50
99  5.25  2.50

[100 rows x 2 columns]

In [25]:
df.loc[2:97, ['M1', 'M2']]

      M1    M2
2   5.00  6.75
3   4.25  4.25
4   4.25  4.50
5   1.50  4.00
6   6.50  6.75
..   ...   ...
93  3.50  4.25
94  4.25  2.50
95  5.25  1.50
96  5.25  3.75
97  7.00  8.00

[96 rows x 2 columns]

In [31]:
df.iloc[2:5 , 1:3]

  GT  DT
2  M NaN
3  M NaN
4  M NaN

In [33]:
df.aggregate({'M1':['min','max'],'M2':['mean','sum']})

       M1       M2
min   1.0      NaN
max   7.0      NaN
mean  NaN    4.255
sum   NaN  425.500

In [38]:
df.groupby(['KV'])['M1'].agg(['count','min','mean','std','max','sum'])

     count   min      mean       std   max    sum
KV
1       60  1.00  3.575000  1.401649  7.00  214.5
2       19  1.25  4.052632  1.566975  6.75   77.0
2NT     21  2.00  3.928571  1.351256  7.00   82.5

In [36]:
pd.pivot_table(df,values=['M1','M2'], columns='KV', aggfunc=['min','mean','max'])

    min                 mean                       max
KV    1     2  2NT         1         2       2NT     1     2  2NT
M1  1.0  1.25  2.0  3.575000  4.052632  3.928571  7.00  6.75  7.0
M2  1.5  3.50  2.5  4.054167  4.565789  4.547619  6.75  6.75  8.0